Repository: HTD/MaxDistancePatch
Catalog: Properties/Resources.*.resx
Languages: pl_pl

source: All done.
pl_pl: Poprawki wprowadzone.

# AlreadyPatched
source: Already patched. Nothing to do.
pl_pl: Poprawka już wprowadzona. Nie ma nic do zrobienia.

# ApplyingPatch
source: Applying the patch
pl_pl: Wprowadzanie poprawek

# BackupMessage
source: When the patch is applied you can restore previous files from an automatically created backup.
pl_pl: Po zastosowaniu patcha można przywrócić zastąpione pliki z automatycznie utworzonej kopii zapasowej.

# CannotWrite
source: Access denied while writing to the file. Try to run this program as Administrator.
pl_pl: Bład dostępu podczas zapisu pliku. Spróbuj uruchomić ten program jako Administrator.

# Description
source: Removes historic object visibility limits in the simulator.
pl_pl: Patch usuwa historyczne ograniczenia widoczności obiektów w symulatorze.

# DescriptionDetailed
source: The distance the objects are visible from was set up in scenery files. This allowed the simulator to display only those object which are not too far from the camera. The authors who made sceneries many years ago on legacy computers set those values so low to cause visible and disturbing visual artifact of objects jumping suddelny into view. On some sceneries, like Drawinowo - the lanscape beyond the windshield looked a little desert-like. The current version of the simulator calculates objects visibility automatically, unless the fixed value is set in a scenery file. This program removes all fixed visibility limits and allows the simulator to decide what should be rendered based on dynamic calculations.
pl_pl: Odległość, z której widoczne są obiekty była ustawiana w samych sceneriach, co pozwalało nie wyświetlać obiektów, które wg autora scenerii są zbyt daleko od kamery. Autorzy tworzący scenerie wiele lat temu na zabytkowych komputerach ustawiali te warości tak nisko, że podczas jazdy często można zaobserwować bardzo przeszkadzający efekt nagłego wyskakiwania obiektów takich jak budynki, semafory czy drzewa przed kamerą. Sceneria taka jak Drawinowo potrafiła miejscami wyglądać pustynnie. Dzisiejsza wersja symulatora automatycznie oblicza widoczność obiektów, pod warunkiem jednak, że odległość nie jest jawnie zapisana w scenerii. Ta poprawka usuwa wszystkie ograniczenia widoczności z plików, pozwalając symulatorowi zadecydować o widoczności na podstawie obliczeń.

source: Initializing
pl_pl: Uruchamianie

# InvalidDirectory
source: Move this file to main MaSzyna directory and try again.
pl_pl: Przenieś ten plik do katalogu z MaSzyną i spróbuj ponownie.

# PatchCommand
source: PATCH
pl_pl: ZASTOSUJ

# ReadyNodesFound
source: Ready. {0} limited visibility nodes found.
pl_pl: Gotów. Znaleziono {0} ograniczeń widoczności.

# SearchingForLimitedNodes
source: Searching for limited visibility nodes
pl_pl: Szukanie węzłów z ograniczeniem widoczności
